{
  "experiences": [
    {
      "id": "cimpress-senior",
      "company": "Cimpress",
      "position": "Senior Software Developer",
      "duration": "July 2025 - Present",
      "location": "Remote",
      "description": "Recently promoted to Senior Software Developer, leading backend initiatives to improve scalability, system performance, and feature expansion across critical order processing systems.",
      "achievements": [
        "Promoted to Senior Software Developer in July 2025",
        "Architected modular AWS Step Functions workflow to replace monolithic Lambdas, reducing order creation time by 50%",
        "Enhanced order pipeline reliability with a retry system using PostgreSQL and AWS SQS, cutting manual intervention by 90%",
        "Designed and deployed secure IVR-support API with Snowflake analytics integration for improved call center operations",
        "Developed tax recalculation Lambda improving post-shipment tax accuracy by 20%",
        "Mentored junior developers and supported technical decision-making in team architecture reviews"
      ],
      "technologies": [
        "Node.js",
        "TypeScript",
        "PostgreSQL",
        "AWS Step Functions",
        "AWS Lambda",
        "AWS SQS",
        "Snowflake",
        "Express.js"
      ],
      "companyUrl": "https://cimpress.com",
      "isCurrentRole": true
    },
    {
      "id": "cimpress-developer",
      "company": "Cimpress",
      "position": "Software Developer",
      "duration": "August 2023 - June 2025",
      "location": "Remote",
      "description": "Worked on critical backend systems for order workflows, multi-line product support, and legacy system decoupling, contributing to performance, maintainability, and customer experience.",
      "achievements": [
        "Implemented Matrix Multi-Line Ordering system allowing agents to combine multiple products in a single order",
        "Maintained backward compatibility with legacy systems while introducing new APIs for order modification",
        "Built microservice to manage calendar-based order holds using event-driven triggers, reducing Oracle system dependency",
        "Improved order event processing via a retry mechanism to minimize manual troubleshooting"
      ],
      "technologies": [
        "Node.js",
        "TypeScript",
        "PostgreSQL",
        "AWS Lambda",
        "AWS SQS",
        "AWS Step Functions",
        "DynamoDB",
        "Express.js"
      ],
      "companyUrl": "https://cimpress.com",
      "isCurrentRole": false
    },
    {
      "id": "cimpress-intern",
      "company": "Cimpress",
      "position": "Software Engineering Intern",
      "duration": "February 2023 - July 2023",
      "location": "Remote",
      "description": "Joined Cimpress as a backend engineering intern, contributing to backend testing, performance reliability, and system optimization.",
      "achievements": [
        "Increased backend test coverage from 54.3% to over 80% by integrating SonarQube into CI pipelines",
        "Resolved recurring payment failures by fixing alert triggers and improving DynamoDB consistency",
        "Refactored legacy code for improved maintainability by removing outdated PRM logic"
      ],
      "technologies": [
        "Node.js",
        "TypeScript",
        "DynamoDB",
        "CI/CD",
        "SonarQube"
      ],
      "companyUrl": "https://cimpress.com",
      "isCurrentRole": false
    }
  ]  
}
